_posts/2016-07-05-http.html
---
title: "http与https"
date: 2016-07-05
layout: post
categories: 
- 网络知识
tags: 
- http
published: true
comments: 
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline4">1. Socket</a>
<ul>
<li><a href="#orgheadline1">TCP/IP</a></li>
<li><a href="#orgheadline2">IANA</a></li>
<li><a href="#orgheadline3">Socket的分类</a></li>
</ul>
</li>
<li><a href="#orgheadline13">2. Web相关知识</a>
<ul>
<li><a href="#orgheadline5">Web资源</a></li>
<li><a href="#orgheadline6">URI\URL\URN</a></li>
<li><a href="#orgheadline7">网站访问量</a></li>
<li><a href="#orgheadline8">Web服务器的类型</a></li>
<li><a href="#orgheadline12">I/O</a>
<ul>
<li><a href="#orgheadline9">I/O类型</a></li>
<li><a href="#orgheadline10">I/O模型</a></li>
<li><a href="#orgheadline11">并发访问响应模型(Web I/O)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline25">3. http</a>
<ul>
<li><a href="#orgheadline14">http(HyperText Transfer Procotol)</a></li>
<li><a href="#orgheadline15">http请求处理过程</a></li>
<li><a href="#orgheadline16">https访问过程</a></li>
<li><a href="#orgheadline24">http事务</a>
<ul>
<li><a href="#orgheadline17">报文分类</a></li>
<li><a href="#orgheadline18">method</a></li>
<li><a href="#orgheadline19">version</a></li>
<li><a href="#orgheadline20">status与reason-phrase</a></li>
<li><a href="#orgheadline21">headers</a></li>
<li><a href="#orgheadline23">entity-body</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">1</span> Socket</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1">TCP/IP</h3>
<div class="outline-text-3" id="text-orgheadline1">
<ul class="org-ul">
<li><code>链路层</code>: 提供设备间的通信</li>
<li><code>网络层</code>: 提供主机间的通信</li>
<li><code>传输层</code>: 提供进程间的通信，包括tcp和udp协议，端口号是0-65535</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2">IANA</h3>
<div class="outline-text-3" id="text-orgheadline2">
<p>
<code>IANA</code> 负责分配端口号
</p>
<ul class="org-ul">
<li><code>0-1023</code>: 众所周知、永久的分配给固定的应用使用的特权端口，如 <code>22/tcp(ssh)</code>, <code>80/tcp(http)</code>, <code>443/tcp(https)</code></li>
<li><code>1024-41951</code>: 注册端口，但要求并不是特别严格，分配给程序注册为某应用使用，如 <code>11211/tcp/udp (memcached)</code>, <code>3306/tcp(mysql)</code></li>
<li><p>
<code>41952+</code>: 客户端程序随机使用的端口
</p>
<pre class="example">
随机端口的范围的定义在 /proc/sys/net/ipv4/ip_local_port_range
</pre></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3">Socket的分类</h3>
<div class="outline-text-3" id="text-orgheadline3">
<p>
<code>Socket</code> 是IPC的一种实现，允许位于不同主机（甚至同一主机）上不同进程之间进行通信和数据交换
</p>
<dl class="org-dl">
<dt>传输层协议</dt><dd><ul class="org-ul">
<li><code>SOCK_STREAM</code>: tcp套接字(流)</li>
<li><code>SOCK_DGRAM</code>: udp套接字(数据包)</li>
<li><code>SOCK_RAW</code>: 裸套接字，直接使用IP</li>
</ul></dd>
<dt>地址类型(Address Family)</dt><dd><ul class="org-ul">
<li><code>AF_INET</code>: IPv4</li>
<li><code>AF_INET6</code>: IPv6</li>
<li><code>AF_UNIX</code>: 同一主机上不同进程之间通信时使用</li>
</ul></dd>
</dl>
</div>
</div>
</div>
<div id="outline-container-orgheadline13" class="outline-2">
<h2 id="orgheadline13"><span class="section-number-2">2</span> Web相关知识</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5">Web资源</h3>
<div class="outline-text-3" id="text-orgheadline5">
<ul class="org-ul">
<li><p>
<code>静态资源</code>: 静态内容，客户端从服务器获得的资源的表现形式与原文件相同
</p>
<pre class="example">
http应用MIME(Multipurpose Internet Mail Extesion)来传输非文本数据，MIME类型决定浏览器调用对应的程序进行处理
  MIME类型: major/minor，例如text/html、text/plain、image/gif
</pre></li>
<li><code>动态资源</code>: 通常是程序文件，需要在服务器执行之后，将执行的结果返回给客户端</li>
</ul>
<pre class="example">
Web页面一般有多个资源，而浏览器对资源的请求通常是并行的
</pre>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6">URI\URL\URN</h3>
<div class="outline-text-3" id="text-orgheadline6">
<ul class="org-ul">
<li><code>URI</code>: Uniform Resource Identifier，URI可以被分为URL、URN或两者的组合</li>
<li><p>
<code>URL</code>: Uniform Resorce Locator，URL是URI的一个子集，告诉我们访问网络位置的方式
</p>
<div class="org-src-container">

<pre class="src src-http">&lt;scheme&gt;://&lt;user&gt;:&lt;password&gt;@&lt;host&gt;:&lt;port&gt;/&lt;path&gt;;&lt;params&gt;?&lt;query&gt;#&lt;frag&gt;
  ;params: 参数，如 http://www.magedu.com/bbs/hello;gender=f
  ?query: 查询条件，如 http://www.magedu.com/bbs/item.php?username=tom&amp;title=abc
  #frag: 跳转到文档中的某位置
</pre>
</div>
<ul class="org-ul">
<li>URL分为相对URL和绝对URL</li>
</ul></li>
<li><code>URN</code>: Uniform Resource Naming，URN是URI的子集，包括名字（给定的命名空间内），但是不包括访问方式</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7">网站访问量</h3>
<div class="outline-text-3" id="text-orgheadline7">
<ul class="org-ul">
<li><code>PV</code>: Page View</li>
<li><code>UV</code>: User View，独立IP量</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8">Web服务器的类型</h3>
<div class="outline-text-3" id="text-orgheadline8">
<dl class="org-dl">
<dt>http服务器程序</dt><dd><ul class="org-ul">
<li>httpd (apache)</li>
<li>nginx</li>
<li>lighttpd</li>
</ul></dd>
<dt>应用程序服务器</dt><dd><ul class="org-ul">
<li>IIS</li>
<li>tomcat, jetty</li>
<li>webshpere, weblogic</li>
</ul></dd>
</dl>
</div>
</div>
<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12">I/O</h3>
<div class="outline-text-3" id="text-orgheadline12">
</div><div id="outline-container-orgheadline9" class="outline-4">
<h4 id="orgheadline9">I/O类型</h4>
<div class="outline-text-4" id="text-orgheadline9">
<dl class="org-dl">
<dt>被调用者消息通知机制</dt><dd><ul class="org-ul">
<li><code>synchronous</code>: 调用发出不会立即返回，但一旦返回则返回最终结果</li>
<li><code>asynchronous</code>: 调用发出之后，被调用方立即返回消息，但返回的非最终结果；被调用者通过状态、通知机制来通知调者，或通过回调函数来处理结果</li>
</ul></dd>
<dt>调用者等待调用结果的状态</dt><dd><ul class="org-ul">
<li><code>block</code>: 调用结果返回之前，调用者(调用线程)会被挂起，在得到结果之后才会返回</li>
<li><code>nonblock</code>: 调用结果返回之前，调用不会阻塞当前线程</li>
</ul></dd>
</dl>
</div>
</div>
<div id="outline-container-orgheadline10" class="outline-4">
<h4 id="orgheadline10">I/O模型</h4>
<div class="outline-text-4" id="text-orgheadline10">
<ul class="org-ul">
<li><code>blocking I/O</code>: 调用者会被阻塞</li>
<li><code>nonblocking I/O</code>: 调用者需要自行确认调用的状态</li>
<li><code>I/O multiplexing</code>: 复用型I/O，用于多路并行I/O，如select()、poll()</li>
<li><code>signal driven I/O</code>: 资源从磁盘到内核内存不需要阻塞，完成时通知，但从内核内存到用户内存需要阻塞
<ul class="org-ul">
<li>通知机制: <code>水平触发</code> (多次通知)、 <code>边缘触发</code> (只通知一次)</li>
</ul></li>
<li><code>asyncrhonous I/O</code>: 资源从磁盘到内核内存和从内核内存到用户内存都不需要阻塞，完成时通知</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline11" class="outline-4">
<h4 id="orgheadline11">并发访问响应模型(Web I/O)</h4>
<div class="outline-text-4" id="text-orgheadline11">
<ul class="org-ul">
<li><code>单进程I/O结构</code>: 启动一个进程处理用户请求，而且一次只处理一个，多个请求被串行响应</li>
<li><code>多进程I/O结构</code>: 并行启动多个进程，每个进程响应一个请求</li>
<li><code>复用I/O结构</code>: 一个进程响应n个请求
<ul class="org-ul">
<li><code>多线程模型</code>: 一个进程生成N个线程，每个线程响应一个用户请求</li>
<li><code>事件驱动</code>: event-driven，用一个进程调用多个进程</li>
</ul></li>
<li><code>复用的多进程I/O结构</code>: 启动多个进程，每个进程响应n个请求</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline25" class="outline-2">
<h2 id="orgheadline25"><span class="section-number-2">3</span> http</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14">http(HyperText Transfer Procotol)</h3>
<div class="outline-text-3" id="text-orgheadline14">
<ul class="org-ul">
<li>http版本
<ul class="org-ul">
<li><code>HTTP/0.9</code>: 原型版本，功能简陋</li>
<li><code>HTTP/1.0</code>: 第一个广泛使用的版本，支持MIME</li>
<li><code>HTTP/1.1</code>: 增强了缓存功能</li>
<li><code>HTTP/2.0</code>: 使用SSL</li>
</ul></li>
<li><p>
http协议是 <code>stateless</code> 的，服务器无法持续追踪访问者来源
</p>
<pre class="example">
开发者使用cookie和session来追踪同一个用户
cookie机制采用的是在客户端保持状态的方案，而session机制采用的是在服务器端保持状态的方案，服务器通过客户端的cookie来识别存储在服务器对应session中的用户信息
</pre></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15">http请求处理过程</h3>
<div class="outline-text-3" id="text-orgheadline15">
<ol class="org-ol">
<li><code>建立或处理连接</code>: 接收请求或拒绝请求</li>
<li><code>接收请求</code>: 接收来自于网络的请求报文中对某资源的一次请求的过程</li>
<li><code>处理请求</code>: 对请求报文进行解析，并获取请求的资源及请求方法等相关信息
=- 通过请求报文的首部进行判断</li>
<li><code>访问资源</code>: 获取请求报文中请求的资源</li>
<li><code>构建响应报文</code></li>
<li><code>发送响应报文</code></li>
<li><code>记录日志</code></li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16">https访问过程</h3>
<div class="outline-text-3" id="text-orgheadline16">
<ol class="org-ol">
<li>建立443端口的TCP连接</li>
<li>客户端发送可供选择的加密方式，并向服务器请求证书</li>
<li>服务器端发送证书以及选定的加密方式给客户端</li>
<li>客户端取得证书并与其信任CA进行证书验证
<ol class="org-ol">
<li>验证证书来源的合法性: 用CA的公钥解密证书上数字签名</li>
<li>验证证书的内容的合法性: 完整性验证</li>
<li>检查证书的有效期限</li>
<li>检查证书是否被吊销</li>
<li>证书中拥有者的名字，与访问的目标主机要一致</li>
</ol></li>
<li>客户端生成临时会话密钥（对称密钥），并使用服务器端的公钥加密此数据发送给服务器，完成密钥交换
<ul class="org-ul">
<li>由于SSL会话是基于IP地址创建的，所以在单IP的地址上，仅可以使用一个https虚拟主机</li>
</ul></li>
<li>服务用此密钥加密用户请求的资源，响应给客户端</li>
</ol>
</div>
</div>

<div id="outline-container-orgheadline24" class="outline-3">
<h3 id="orgheadline24">http事务</h3>
<div class="outline-text-3" id="text-orgheadline24">
</div><div id="outline-container-orgheadline17" class="outline-4">
<h4 id="orgheadline17">报文分类</h4>
<div class="outline-text-4" id="text-orgheadline17">
<dl class="org-dl">
<dt>request报文</dt><dd><div class="org-src-container">

<pre class="src src-html">&lt;<span style="color: #A6E22E;">method</span>&gt; &lt;<span style="color: #A6E22E;">request-URL</span>&gt; &lt;<span style="color: #A6E22E;">version</span>&gt;
&lt;<span style="color: #A6E22E;">headers</span>&gt;

&lt;<span style="color: #A6E22E;">entity-body</span>&gt;
</pre>
</div></dd>
<dt>response报文</dt><dd><div class="org-src-container">

<pre class="src src-html">&lt;<span style="color: #A6E22E;">version</span>&gt; &lt;<span style="color: #A6E22E;">status</span>&gt; &lt;<span style="color: #A6E22E;">reason-phrase</span>&gt;
&lt;<span style="color: #A6E22E;">headers</span>&gt;

&lt;<span style="color: #A6E22E;">entity-body</span>&gt;
</pre>
</div></dd>
</dl>
</div>
</div>
<div id="outline-container-orgheadline18" class="outline-4">
<h4 id="orgheadline18">method</h4>
<div class="outline-text-4" id="text-orgheadline18">
<p>
请求方法: 标明客户端希望服务器对资源执行的动作
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">请求方法</th>
<th scope="col" class="org-left">含义</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">GET</td>
<td class="org-left">从服务器获取一个资源</td>
</tr>

<tr>
<td class="org-left">HEAD</td>
<td class="org-left">只从服务器获取文档的响应首部，即不获取文档内容</td>
</tr>

<tr>
<td class="org-left">POST</td>
<td class="org-left">向服务器发送要处理的数据</td>
</tr>

<tr>
<td class="org-left">PUT</td>
<td class="org-left">将请求的主体部分存储在服务器上</td>
</tr>

<tr>
<td class="org-left">DELETE</td>
<td class="org-left">请求删除服务器上指定的文档</td>
</tr>

<tr>
<td class="org-left">TRACE</td>
<td class="org-left">追踪请求到达服务器中间经过的代理服务器</td>
</tr>

<tr>
<td class="org-left">OPTIONS</td>
<td class="org-left">请求服务器返回对指定资源支持使用的请求方法</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgheadline19" class="outline-4">
<h4 id="orgheadline19">version</h4>
<div class="outline-text-4" id="text-orgheadline19">
<p>
标识http版本，如 <code>HTTP/1.1</code>
</p>
</div>
</div>

<div id="outline-container-orgheadline20" class="outline-4">
<h4 id="orgheadline20">status与reason-phrase</h4>
<div class="outline-text-4" id="text-orgheadline20">
<p>
<code>status</code> 标记请求处理过程中发生的情况的状态码， <code>reason-phrase</code> 则是状态码所标记的状态的简要描述
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">请求码</th>
<th scope="col" class="org-left">含义</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1xx</td>
<td class="org-left">信息提示</td>
</tr>

<tr>
<td class="org-right">2xx</td>
<td class="org-left">成功</td>
</tr>

<tr>
<td class="org-right">3xx</td>
<td class="org-left">重定向与资源相关</td>
</tr>

<tr>
<td class="org-right">4xx</td>
<td class="org-left">错误类信息，客户端错误</td>
</tr>

<tr>
<td class="org-right">5xx</td>
<td class="org-left">错误类信息，服务器端错误</td>
</tr>
</tbody>
</table>


<dl class="org-dl">
<dt>常用状态码</dt><dd><ul class="org-ul">
<li><code>200(OK)</code>: 成功，请求的所有数据通过响应报文的entity-body部分发送</li>
<li><code>301(Moved Permanently)</code>: 请求的URL指向的资源已经被删除，但在响应报文中通过首部Location指明了资源现在所处的新位置</li>
<li><code>302(Found)</code>: 与301相似，但为 <b>临时重定向</b> ，在响应报文中通过Location指明资源现在所处临时新位置</li>
<li><code>304(Not Modified)</code>: 客户端发出了条件式请求，但服务器上的资源未曾发生改变，则通过响应此响应状态码通知客户端</li>
<li><code>401(Unauthorized)</code>: 需要输入账号和密码认证方能访问资源</li>
<li><code>403(Forbidden)</code>: 请求被禁止</li>
<li><code>404(Not Found)</code>: 服务器无法找到客户端请求的资源</li>
<li><code>500(Internal Server Error)</code>: 服务器内部错误</li>
<li><code>502(Bad Gateway)</code>: 代理服务器从后端服务器收到了一条伪响应</li>
</ul></dd>
</dl>
</div>
</div>

<div id="outline-container-orgheadline21" class="outline-4">
<h4 id="orgheadline21">headers</h4>
<div class="outline-text-4" id="text-orgheadline21">
<p>
每个请求或响应报文可包含任意个首部，格式由多行 <code>Name: Value</code> 组成
</p>
</div>
<ul class="org-ul"><li><a id="orgheadline22"></a>首部的分类<br  /><div class="outline-text-5" id="text-orgheadline22">
<dl class="org-dl">
<dt>通用首部</dt><dd><ul class="org-ul">
<li><code>Date</code>: 报文的创建时间</li>
<li><code>Connection</code>: 连接状态，如 <code>keep-alive</code>, <code>close</code></li>
<li><code>Via</code>: 显示报文经过的中间节点</li>
<li><code>Cache-Control</code>: 控制缓存</li>
<li><code>Pragma</code>: 兼容HTTP/1.0，与缓存相关</li>
</ul></dd>

<dt>请求首部</dt><dd><dl class="org-dl">
<dt>信息式</dt><dd><ul class="org-ul">
<li><p>
<code>Accept</code>: 可接受的媒体类型
</p>
<div class="org-src-container">

<pre class="src src-yaml"><span style="color: #FD971F;">Accept</span>: Value;q=0.8  <span style="color: #75715E;"># </span><span style="color: #75715E;">q&#20026;&#35813;Value&#30340;&#26435;&#20540;&#65292;&#40664;&#35748;&#20026;1</span>
</pre>
</div></li>
<li><code>Accept-Charset</code>: 可接受的字符集</li>
<li><code>Accept-Encoding</code>: 可接受编码格式，如gzip</li>
<li><code>Accept-Language</code>: 可接受的语言</li>
<li><code>Client-IP</code>: 客户端IP</li>
<li><code>Host</code>: 请求的服务器名称[和端口号]</li>
<li><code>Referer</code>: 包含当前正在请求的资源的上一级资源，即从什么地址引用</li>
<li><code>User-Agent</code>: 客户端代理</li>
</ul></dd>
<dt>条件式</dt><dd><ul class="org-ul">
<li><code>Expect</code>: 期望的资源类型</li>
<li><code>If-Modified-Since</code>: 自从指定的时间之后，请求的资源是否发生过修改</li>
<li><code>If-Unmodified-Since</code>: 自从指定的时间之后，请求的资源是否未发生修改</li>
<li><code>If-None-Match</code>: 本地缓存中存储的文档的 <code>ETag</code> 标签是否与服务器文档的 <code>ETag</code> 不匹配</li>
<li><code>If-Match</code>: 本地缓存中存储的文档的 <code>ETag</code> 标签是否与服务器文档的 <code>ETag</code> 匹配</li>
</ul></dd>
<dt>安全</dt><dd><ul class="org-ul">
<li><code>Authorization</code>: 向服务器发送认证信息，如账号和密码</li>
<li><code>Cookie</code>: 客户端向服务器发送cookie</li>
<li><code>Cookie2</code>:</li>
</ul></dd>
<dt>代理</dt><dd><ul class="org-ul">
<li><code>Proxy-Authorization</code>: 向代理服务器认证</li>
</ul></dd>
</dl></dd>

<dt>响应首部</dt><dd><dl class="org-dl">
<dt>信息性</dt><dd><ul class="org-ul">
<li><code>Age</code>: 从原始服务器到代理缓存形成的估算时间</li>
<li><code>Server</code>: 服务器程序软件名称和版本</li>
</ul></dd>
<dt>协商首部</dt><dd>某资源有多种表示方法时使用
<ul class="org-ul">
<li><code>Accept-Ranges</code>: 服务器可接受的请求范围类型</li>
<li><code>Vary</code>: 告诉下游代理是使用缓存响应还是从原始服务器请求</li>
</ul></dd>
<dt>安全</dt><dd><ul class="org-ul">
<li><code>WWW-Authenticate</code>: 来自服务器的对客户端的质询认证表单</li>
<li><code>Set-Cookie</code>: 向客户端设置cookie</li>
<li><code>Set-Cookie2</code>:</li>
</ul></dd>
</dl></dd>

<dt>实体首部</dt><dd><dl class="org-dl">
<dt>描述实体(body)</dt><dd><ul class="org-ul">
<li><code>Allow</code>: 列出对此实体可使用的请求方法</li>
<li><code>Location</code>: 告诉客户端真正的实体位于何处</li>
<li><code>Content-Encoding</code>:</li>
<li><code>Content-Language</code>:</li>
<li><code>Content-Length</code>: 主体的长度</li>
<li><code>Content-Location</code>: 实体真正所处位置</li>
<li><code>Content-Type</code>: 主体的对象类型</li>
</ul></dd>
<dt>缓存相关</dt><dd><ul class="org-ul">
<li><code>ETag</code>: 实体的扩展标签</li>
<li><code>Expires</code>: 实体的过期时间</li>
<li><code>Last-Modified</code>: 最后一次修改的时间</li>
</ul></dd>
</dl></dd>
</dl>
</div></li></ul>
</div>

<div id="outline-container-orgheadline23" class="outline-4">
<h4 id="orgheadline23">entity-body</h4>
<div class="outline-text-4" id="text-orgheadline23">
<p>
请求时附加的数据或响应时附加的数据
</p>
</div>
</div>
</div>
</div>
